<?php
/**
 * Created by PhpStorm.
 * User: ali
 * Date: 6/20/17
 * Time: 4:33 PM
 */
return [

    // Message
    // Message
    'm00000' => 'سراب',

    // Success
    's00000' => 'موفقیت آمیز',

    // General Dev Error
    'f00000' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',

    // Request
    'f00100' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',
    'f00101' => 'درخواست نامعتبر است', // request in not valid
    'f00102' => 'ورودی ها نامعتبراند', // request is not in right format. its template in not valid
    'f00103' => 'هیج جوابی برای درخواست شما وجود ندارد', // not found

    // Response
    'f00200' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',
    'f00201' => 'مشکل در پاسخ', // response template is not valid

    // Database
    'f00300' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',
    'f00301' => 'خطا در ذخیره سازی',

    // Authentication
    'f00400' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',
    'f00401' => 'نام کاربری یا رمز عبور اشتباه است',
    'f00402' => 'اکانت مورد نظر معتبر نیست',
    'f00403' => 'خطا در ورود',
    'f00404' => 'خطا در ورود',
    'f00405' => 'خطا در ورود',
    'f00406' => 'خطا در ورود',
    'f00407' => 'خطا در ورود',
    'f00408' => 'خطا در ورود',
    'f00409' => 'خطا در ورود',
    'f00410' => 'خطا در ورود',
    'f00411' => 'خطا در ورود',
    'f00412' => 'خطا در ورود',
    'f00413' => 'خطا در ورود',

    // Acl
    'f00500' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',
    'f00501' => 'دسترسی غیر مجاز',
    'f00502' => 'دسترسی غیر مجاز',
    'f00503' => 'دسترسی غیر مجاز',

    // Request Hash
    'f00600' => 'لطفا کمی صبر کنید در حال رفع ایراد هستیم. مرسی',
    'f00601' => 'درخواست مجاز نیست',
    'f00602' => 'درخواست مجاز نیست',
    'f00603' => 'درخواست مجاز نیست',
    'f00604' => 'درخواست مجاز نیست',
    'f00605' => 'درخواست مجاز نیست',
    'f00606' => 'درخواست مجاز نیست',
    'f00607' => 'درخواست مجاز نیست',
    'f00608' => 'درخواست مجاز نیست',
    'f00609' => 'درخواست مجاز نیست',
];
